LeeNX/ESP32-BLE-Gamepad/BleGamepad.cpp
  	// USAGE (Start Delay)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xa7;

  	// UNIT (Eng Lin:Time)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x66;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x03;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x10;

  	// UNIT_EXPONENT (-3)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x55;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xfd;

  	// LOGICAL_MINIMUM (00)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

  	// LOGICAL_MAXIMUM (7F FF)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x26;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xff;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x7f;

  	// PHYSICAL_MINIMUM (00)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x35;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

  	// PHYSICAL_MAXIMUM (7F FF)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x46;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xff;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x7f;

  	// REPORT_SIZE (10)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x10;

  	// REPORT_COUNT (01)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  	// OUTPUT (Data,Var,Abs)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x91;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

  	// UNIT (None)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x66;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

    // UNIT_EXPONENT (00)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x55;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

    // https://github.com/YukMingLaw/ArduinoJoystickWithFFBLibrary/blob/master/src/FFBDescriptor.h

    // PID State Report
    // USAGE_PAGE (Physical Interface)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x0f;

    // USAGE (PID State Report)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x92;

    // COLLECTION (Logical)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xa1;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

  	// REPORT_ID (02)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x85;
    tempHidReportDescriptor[hidReportDescriptorSize++] = configuration.getHidReportId() + 2;

  	// USAGE (Device Paused)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x9f;

  	// USAGE (Actuators Enabled)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xa0;

  	// USAGE (Safety Switch)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xa4;

  	// USAGE (Actuator Override Switch)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xa5;

  	// USAGE (Actuator Power)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xa6;

  	// LOGICAL_MINIMUM (00)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

  	//  Logical Maximum (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x25;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  	//  Physical Minimum (0)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x35;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

  	//  Physical Maximum (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x45;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  	//  Report Size (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  	//  Report Count (5)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;

  	//  Input (variable,absolute)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x81;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

  	//  Report Count (3)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x03;

  	//  Input (Constant, Variable)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x81;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x03;

  	//  Usage (Effect Playing)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x94;

  	//  Logical Minimum (0)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

  	//  Logical Maximum (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x25;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  	//  Physical Minimum (0)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x35;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

  	//  Physical Maximum (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x45;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  	//  Report Size (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  	//  Report Count (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  	//  Input (variable,absolute)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x81;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

  	//  Usage (Effect Block Index)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x22;

