LeeNX/ESP32-BLE-Gamepad/BleGamepad.cpp
  	//  Logical Minimum (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  	//  Logical Maximum (40)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x25;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x28;

  	//  Physical Minimum (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x35;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  	//  Physical Maximum (40)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x45;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x28;

  	//  Report Size (7)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x07;

  	//  Report Count (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  	//  Input (variable,absolute)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x81;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

    //End Collection Datalink (Logical) (OK)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xc0;

    //================================OutputReport======================================//

    // SetEffectReport
    //Usage (Set Effect Report)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x21;

    //Collection Datalink (Logical)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xa1;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

   	//Report ID 1
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x85;
    tempHidReportDescriptor[hidReportDescriptorSize++] = configuration.getHidReportId() + 3;

   	//  Usage (Effect Block Index)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x22;

   	//   Logical Minimum (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

   	//   Logical Maximum (40)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x25;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x28;

   	//   Physical Minimum (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x35;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

   	//   Physical Maximum (40)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x45;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x28;

   	//   Report Size (8)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x08;

   	//   Report Count (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

   	//   Output (Data,Var,Abs)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x91;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

   	//  Usage (Effect Type)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x25;

   	//    Collection Datalink (Logical)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xa1;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

     	// USAGE (26)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x26;

     	// USAGE (27)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x27;

     	// USAGE (30)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x30;

     	// USAGE (31)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x31;

     	// USAGE (32)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x32;

     	// USAGE (33)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x33;

   	  // USAGE (34)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x34;

   	  // USAGE (40)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x40;

   	  // USAGE (41)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x41;

   	  // USAGE (42)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x42;

   	  // USAGE (43)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x43;

   	  // USAGE (28)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x28;

   	  // Usage (ET Custom Force Data)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x28;

   	  //       Logical Minimum (1)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

   	  //       Logical Maximum (12)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x25;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x0c;

   	  //       Physical Minimum (1)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x35;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

   	  //       Physical Maximum (12)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x45;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x0c;

   	  //       Report Size (8)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x08;

   	  //       Report Count (1)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

   	  //       Output (Data)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x91;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

   	//    End Collection Datalink (Logical)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xc0;

   	//    Usage (Duration)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x50;

