LeeNX/ESP32-BLE-Gamepad/BleGamepad.cpp
   	//    Usage (Trigger Repeat Interval)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x54;

   	//    Usage (Sample Period)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x51;

   	//     Logical Minimum (0)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

   	//     Logical Maximum (32767)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x26;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xff;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x7f;

   	//     Physical Minimum (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x35;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

   	//     Physical Maximum (32767)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x46;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xff;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x7f;

   	//     Unit (4099)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x66;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x03;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x10;

   	//     Unit Exponent (253)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x55;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xfd;

   	//     Report Size (16)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x10;

   	//     Report Count (3)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x03;

   	//     Output (Data,Var,Abs)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x91;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

   	//     Unit Exponent (0)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x55;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

   	//     Unit (0)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x66;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

   	//    Usage (Gain)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x52;

   	//     Logical Minimum (0)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

   	//     Logical Maximum (255)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x26;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xff;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

   	//     Physical Minimum (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x35;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

   	//     Physical Maximum (10000)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x46;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x10;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x27;

   	//     Report Size (8)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x08;

   	//     Report Count (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

   	//     Output (Data,Var,Abs)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x91;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

   	//    Usage (Trigger Button)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x53;

   	//     Logical Minimum (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

   	//     Logical Maximum (8)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x25;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x08;

   	//     Physical Minimum (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x35;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

   	//     Physical Maximum (8)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x45;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x08;

   	//     Report Size (8)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x08;

   	//     Report Count (1)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

   	//     Output (Data,Var,Abs)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x91;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

   	//    Usage (Axes Enable)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x55;

   	//      Collection Datalink (Logical)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xa1;
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

   	  //        Usage Page (Generic Desktop)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

   	  //        Usage (X)//
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x30;

   	  //        Usage (Y)//
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x31;

   	  //        Logical Minimum (0)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

   	  //        Logical Maximum (1)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x25;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

