LeeNX/ESP32-BLE-Gamepad/BleGamepad.cpp
   	  //        Report Size (1)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

   	  //        Report Count (2)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

   	  //        Output (Data,Var,Abs)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x91;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

   	//      End Collection Datalink (Logical)
    tempHidReportDescriptor[hidReportDescriptorSize++] = 0xc0;


    	//    Usage Page (Physical Interface)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x0f;

    	//      Usage (Direction Enable)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x56;

    	//        Report Count (1)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

    	//        Output (Data,Var,Abs)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x91;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

    	//        Report Count (5)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;

    	//        Output (Constant, Variable)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x91;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x03;

    	//      Usage (Direction)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x57;

    	//        Collection Datalink (Logical)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0xa1;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

    	  //          Usage (Ordinals: Instance 1) - 0x0B, 0x01, 0, 0x0A, 0
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x0b;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x0a;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

    	  //          Usage (Ordinals: Instance 2) - 0x0B, 0x02, 0, 0x0A, 0
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x0b;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x0a;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

    	  //          Unit (20)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x66;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x14;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

    	  //          Unit Exponent (254)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x55;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0xfe;

    	  //          Logical Minimum (0)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

    	  //          Logical Maximum (255)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x26;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0xff;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

    	  //          Physical Minimum (1)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x35;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

    	  //          Physical Maximum (36000) - 0x47, 0xA0, 0x8C, 0, 0
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x47;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0xa0;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x8c;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

    	  //          Unit (0)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x66;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

    	  //          Report Size (8)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x08;

    	  //          Report Count (2)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

    	  //          Output (Data,Var,Abs)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x91;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

    	  //          Unit Exponent (0)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x55;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

    	  //          Unit (0)
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x66;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

    	//        End Collection Datalink (Logical)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0xc0;

    	//    Usage Page (Physical Interface)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x0f;

    	//      Usage (Type Specific Block Offset)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x58;

    	//        Collection (Logical)
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0xa1;
      tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

    	  //          Usage (Ordinals: Instance 1) - 0x0B, 0x01, 0, 0x0A, 0
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x0b;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x0a;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

    	  //          Usage (Ordinals: Instance 2) - 0x0B, 0x02, 0, 0x0A, 0
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x0b;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x0a;
        tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

